{
  "backend/main.mo": "Motoko canister defining user profile storage with access control checks for viewing and saving profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs for build and verification.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing the purpose of various frontend components, hooks, and config files.",
  "frontend/.ic-assets.json": "IC asset configuration defining cache rules and headers for frontend static files including website-code.zip.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist outlining required build steps, asset verification, config validation, and production testing.",
  "frontend/DOMAIN_SETUP.md": "Guide explaining DNS, SSL, and redirect configuration for setting up the sangharshclasses.in custom domain.",
  "frontend/index.css": "Tailwind-based global stylesheet defining design tokens, dark mode variables, and base styling rules.",
  "frontend/index.html": "Source HTML entry file containing SEO metadata, schema.org JSON-LD, canonical links, favicons, and Vite dev script.",
  "frontend/public/_headers": "Sets MIME types and download headers for key static assets.",
  "frontend/public/_redirects": "Defines Netlify-style redirects ensuring static files resolve and all other routes fallback to index.html.",
  "frontend/public/404.html": "SPA fallback page that redirects non-static paths to the root while preserving the original URL.",
  "frontend/public/google53082ab74af04c28.html": "Google site verification HTML file.",
  "frontend/public/robots.txt": "Allows all crawlers and points to the sitemap XML.",
  "frontend/public/sitemap.xml": "Sitemap containing the homepage URL with metadata.",
  "frontend/src/admin/AdminShell.tsx": "Empty placeholder file.",
  "frontend/src/admin/components/AdminAuthPanel.tsx": "Empty placeholder file.",
  "frontend/src/admin/components/AdminGate.tsx": "Empty placeholder file.",
  "frontend/src/admin/components/AdminToasts.ts": "Empty placeholder file.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Empty placeholder file.",
  "frontend/src/admin/components/ProfileSetupModal.tsx": "Empty placeholder file.",
  "frontend/src/admin/pages/AboutEditorPage.tsx": "Empty placeholder file.",
  "frontend/src/admin/pages/AdminHome.tsx": "Empty placeholder file.",
  "frontend/src/admin/pages/AdminUsersPage.tsx": "Empty placeholder file.",
  "frontend/src/admin/pages/ContactEditorPage.tsx": "Empty placeholder file.",
  "frontend/src/admin/pages/CoursesManagerPage.tsx": "Empty placeholder file.",
  "frontend/src/admin/pages/FacultyManagerPage.tsx": "Empty placeholder file.",
  "frontend/src/admin/pages/LayoutSectionsPage.tsx": "Empty placeholder file.",
  "frontend/src/App.tsx": "Main app component initializing diagnostics and SEO guards and rendering HomePage within an error boundary.",
  "frontend/src/components/About.tsx": "Renders the About section using marketing content with paragraphs and a feature card.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs errors and displays a fallback UI.",
  "frontend/src/components/Contact.tsx": "Contact section with phone, WhatsApp, email interactions and styled cards.",
  "frontend/src/components/Courses.tsx": "Displays courses grid and extra info using marketing content with styled cards and features.",
  "frontend/src/components/DomainSetupDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/DownloadWebsiteCodeButton.tsx": "Button that triggers download of a static ZIP file.",
  "frontend/src/components/Faculty.tsx": "Renders faculty cards with photos, roles, experience, and specialization.",
  "frontend/src/components/Footer.tsx": "Footer with site info, quick links, contact details, and social icons.",
  "frontend/src/components/Header.tsx": "Responsive header with scroll effects, navigation links, logo, and mobile sheet menu.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headings, CTAs, and animated stats.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Fallback component showing an error message with reload and homepage buttons.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp CTA button that opens a chat using the configured phone number.",
  "frontend/src/content/marketingSiteContent.ts": "Centralized marketing content including site metadata, hero text, about info, faculty, and course details.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useAdminStatus.ts": "Empty placeholder file.",
  "frontend/src/hooks/useAdminUsers.ts": "Empty placeholder file.",
  "frontend/src/hooks/useBackendActorSafe.ts": "Safe actor hook that initializes backend actor with optional admin token and handles errors non‑fatally.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity management via React context.",
  "frontend/src/hooks/useQueries.ts": "Query hooks for loading and saving the caller’s user profile via the backend actor.",
  "frontend/src/hooks/useSectionConfigs.ts": "Empty placeholder file.",
  "frontend/src/hooks/useWebsiteContent.ts": "Empty placeholder file.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark mode, animations, typography defaults, and custom scrollbar styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage layout by composing header, main content sections, footer, and a WhatsApp button.",
  "frontend/src/static-export/renderStaticSite.ts": "Generates a full static HTML page using marketing content, including escaped text and structured sections.",
  "frontend/src/static-export/staticExportAssets.ts": "Lists image assets and their destination paths for inclusion in static site exports.",
  "frontend/src/static-export/zipWriter.ts": "Implements an in-memory ZIP writer placeholder that tracks added files for static export builds.",
  "frontend/src/utils/contentSerialization.ts": "Empty placeholder file for future content serialization utilities.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Provides runtime logging for errors, promise rejections, and component render starts when diagnostics are enabled.",
  "frontend/src/utils/seoGuards.ts": "Implements SEO guards enforcing canonical URLs and noindex rules depending on domain environment.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, container settings, plugins, and animation/keyframe extensions.",
  "frontend/vite.config.ts": "Vite config enabling React, env injection, dev proxy, and a custom plugin that generates a static-site export, copies assets, and zips the output after build.",
  "project_state.json": "Project metadata describing the app’s architecture, features, and versioned frontend/backend capabilities for a React + Vite site with an ICP backend."
}