{
  "backend/main.mo": "Motoko canister defining user profile storage with Map, guarded by an access control system that enforces user and admin permissions for viewing and saving profiles.",
  "feature_evidence.json": "Structured report documenting sitemap- and SEO-related frontend features, mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files, components, hooks, and public assets used as documentation or planning reference.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Detailed pre- and post-deployment checklist focused on preventing blank screens, validating Vite builds, SPA fallback behavior, and sitemap correctness.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles using the OKLCH color system.",
  "frontend/index.html": "Vite HTML entry point for development, with comments emphasizing that production must serve the built dist/index.html with hashed assets.",
  "frontend/public/_headers": "Static hosting configuration specifying correct Content-Type headers for sitemap.xml and robots.txt.",
  "frontend/public/_redirects": "Redirect rules ensuring sitemap.xml and robots.txt bypass SPA fallback while all other routes rewrite to index.html.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to the app root while explicitly excluding static assets like sitemap.xml and robots.txt.",
  "frontend/public/google53082ab74af04c28.html": "Google Search Console verification file used to confirm domain ownership.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing the public sitemap.xml URL.",
  "frontend/public/sitemap.xml": "Valid XML sitemap defining the homepage URL with metadata for search engine indexing.",
  "frontend/src/admin/AdminShell.tsx": "Empty placeholder file intended to define the main layout or shell for the admin interface.",
  "frontend/src/admin/components/AdminAuthPanel.tsx": "Empty placeholder for an admin authentication panel component.",
  "frontend/src/admin/components/AdminGate.tsx": "Empty placeholder for a component that likely guards admin routes based on authorization.",
  "frontend/src/admin/components/AdminToasts.ts": "Empty placeholder for admin-specific toast or notification utilities.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Empty placeholder for a confirmation dialog used when deleting admin-managed entities.",
  "frontend/src/admin/components/ProfileSetupModal.tsx": "Empty placeholder for a modal guiding admin or user profile setup.",
  "frontend/src/admin/pages/AboutEditorPage.tsx": "Empty placeholder for an admin page used to edit About section content.",
  "frontend/src/admin/pages/AdminHome.tsx": "Empty placeholder for the admin dashboard or landing page.",
  "frontend/src/admin/pages/AdminUsersPage.tsx": "Empty placeholder for an admin page managing user accounts.",
  "frontend/src/admin/pages/ContactEditorPage.tsx": "Empty placeholder for an admin page to edit contact information.",
  "frontend/src/admin/pages/CoursesManagerPage.tsx": "Empty placeholder for an admin page to manage courses.",
  "frontend/src/admin/pages/FacultyManagerPage.tsx": "Empty placeholder for an admin page to manage faculty profiles.",
  "frontend/src/admin/pages/LayoutSectionsPage.tsx": "Empty placeholder for an admin page to configure homepage or layout sections.",
  "frontend/src/App.tsx": "Root React component that initializes runtime diagnostics and wraps the HomePage in an error boundary.",
  "frontend/src/components/About.tsx": "Static About section component rendering Hindi descriptive text and a single result-oriented feature card.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs runtime errors and renders a fallback UI instead of crashing the app.",
  "frontend/src/components/Contact.tsx": "Renders a contact section with phone, WhatsApp, email, and location details using cards and action buttons that trigger call, email, or WhatsApp via browser navigation.",
  "frontend/src/components/Courses.tsx": "Displays a grid of courses for classes 7th–12th with descriptions and highlights like expert faculty and regular tests using card-based UI components.",
  "frontend/src/components/DomainSetupDialog.tsx": "This file is currently empty and does not define any component or logic.",
  "frontend/src/components/Faculty.tsx": "Shows an expert faculty section with profile cards including photos, subjects, experience, and specializations for teaching staff.",
  "frontend/src/components/Footer.tsx": "Implements the website footer with branding, quick navigation links, contact information, social media links, and a dynamic copyright year.",
  "frontend/src/components/Header.tsx": "Provides a fixed responsive header with logo, navigation links, scroll-based styling changes, and a mobile slide-out menu for section navigation.",
  "frontend/src/components/Hero.tsx": "Renders the landing hero section with a background image, headings, guarantee badge, stats, and CTA buttons that smoothly scroll to courses or contact sections.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Displays a full-page error fallback UI with options to refresh the page or navigate back to the homepage when a runtime error occurs.",
  "frontend/src/components/WhatsAppButton.tsx": "Provides a fixed floating WhatsApp contact button that opens a chat to a predefined phone number in a new tab.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on Internet Identity, initializes admin access if available, and invalidates dependent React Query caches on change.",
  "frontend/src/hooks/useAdminStatus.ts": "Empty file placeholder for a hook intended to manage or query admin status.",
  "frontend/src/hooks/useAdminUsers.ts": "Empty file placeholder for a hook intended to manage or query admin users.",
  "frontend/src/hooks/useBackendActorSafe.ts": "Provides a safer backend actor hook that optionally initializes admin access control and handles errors non-fatally using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, handling login, logout, identity persistence, and login status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and save the current caller’s user profile using a safe backend actor.",
  "frontend/src/hooks/useSectionConfigs.ts": "Empty file placeholder for a hook intended to load or manage section configuration data.",
  "frontend/src/hooks/useWebsiteContent.ts": "Empty file placeholder for a hook intended to fetch or manage website content.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining brand color variables, light/dark themes, base styles, animations, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app with React Query and Internet Identity providers, and mounts it to the DOM.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage layout by assembling header, hero, content sections, footer, and a floating WhatsApp button.",
  "frontend/src/utils/contentSerialization.ts": "Empty utility file placeholder for content serialization logic.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Provides runtime diagnostics utilities to log initialization, render starts, and capture uncaught errors and unhandled promise rejections.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them. Includes logic to prioritize URL values, handle errors safely, and remove sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode via class, content scanning paths, centered containers, and extensive theme extensions for colors, radii, animations, and charts. Enables typography, container queries, and animation plugins.",
  "frontend/vite.config.ts": "Defines Vite configuration for a React app with relative asset paths for static/IC hosting, environment variable injection, and path aliases. Configures build output naming, dev server port, and API proxy to a local backend.",
  "project_state.json": "Machine-readable snapshot of the project describing schema/versioning and a high-level summary of a Vite + React + Tailwind marketing SPA with an Internet Computer backend. Enumerates existing features and their descriptions to track current functionality and project scope."
}