{
  "backend/main.mo": "Motoko canister implementing access-controlled user profile storage with getters and a save method plus a public sitemap URL query.",
  "feature_evidence.json": "Feature evidence report listing sitemap-generation requirements, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose of various frontend files and components.",
  "frontend/.ic-assets.json": ".ic-assets configuration specifying caching and MIME headers for deployed frontend assets.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Comprehensive deployment checklist covering build validation, asset verification, redirects, and production preview checks.",
  "frontend/DOMAIN_SETUP.md": "Guide explaining DNS records, Caffeine configuration, and canonical-domain redirects for sangharshclasses.in.",
  "frontend/index.css": "Tailwind base styles defining global color tokens and dark mode variables with applied utility rules.",
  "frontend/index.html": "HTML entry point with SEO metadata, canonical tags, structured data, favicons, and Vite script loader.",
  "frontend/public/_headers": "Static hosting headers mapping content types for sitemap, robots, favicons, and ZIP download.",
  "frontend/public/_redirects": "Redirect rules ensuring static assets return 200 and routing all other paths to index.html.",
  "frontend/public/404.html": "SPA fallback page that redirects deep links to root while excluding static assets from redirect.",
  "frontend/public/google53082ab74af04c28.html": "Google Search Console domain verification file with required verification string.",
  "frontend/public/robots.txt": "Robots.txt permitting full crawling and referencing the sitemap URL.",
  "frontend/public/sitemap.xml": "Static sitemap listing the homepage with weekly change frequency.",
  "frontend/src/admin/AdminShell.tsx": "Empty placeholder file for the admin shell component.",
  "frontend/src/admin/components/AdminAuthPanel.tsx": "Empty placeholder for an admin authentication panel component.",
  "frontend/src/admin/components/AdminGate.tsx": "Empty placeholder for an admin-access gate component.",
  "frontend/src/admin/components/AdminToasts.ts": "Empty placeholder for admin toast notifications.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Empty placeholder for a deletion confirmation dialog.",
  "frontend/src/admin/components/ProfileSetupModal.tsx": "Empty placeholder for a profile setup modal.",
  "frontend/src/admin/pages/AboutEditorPage.tsx": "Empty placeholder for an admin page to edit About content.",
  "frontend/src/admin/pages/AdminHome.tsx": "Empty placeholder for the admin home page.",
  "frontend/src/admin/pages/AdminUsersPage.tsx": "Empty placeholder for an admin user management page.",
  "frontend/src/admin/pages/ContactEditorPage.tsx": "Empty placeholder for a contact information editor page.",
  "frontend/src/admin/pages/CoursesManagerPage.tsx": "Empty placeholder for a courses management page.",
  "frontend/src/admin/pages/FacultyManagerPage.tsx": "Empty placeholder for a faculty management page.",
  "frontend/src/admin/pages/LayoutSectionsPage.tsx": "Empty placeholder for managing layout sections in admin.",
  "frontend/src/App.tsx": "Main app component initializing diagnostics and SEO guards, wrapping HomePage in an error boundary.",
  "frontend/src/components/About.tsx": "Renders the About section using marketing content, including paragraphs and a feature card.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary component that catches runtime errors and displays a fallback UI.",
  "frontend/src/components/Contact.tsx": "Contact section displaying phone, email, location, and action buttons with marketing content.",
  "frontend/src/components/Courses.tsx": "Courses section showing course cards and an additional info banner from marketing content.",
  "frontend/src/components/DomainSetupDialog.tsx": "Empty placeholder for a domain setup dialog component.",
  "frontend/src/components/DownloadWebsiteCodeButton.tsx": "Button that downloads a static ZIP file containing the website code.",
  "frontend/src/components/Faculty.tsx": "Faculty section rendering educator cards with photos, subjects, and experience details.",
  "frontend/src/components/Footer.tsx": "Footer displaying site info, links, contact details, and social icons using marketing content.",
  "frontend/src/components/Header.tsx": "Header with scroll-based styling, navigation links, mobile menu, and a download button.",
  "frontend/src/components/Hero.tsx": "Renders the homepage hero section with background image, headings, CTAs, and animated stats using marketing content.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Displays an error fallback card with options to refresh the page or return home.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp button that opens a chat using the phone number from marketing content.",
  "frontend/src/content/marketingSiteContent.ts": "Centralized JSON-like content for the marketing site, including hero, about, faculty, and course details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing on identity changes and invalidating related queries.",
  "frontend/src/hooks/useAdminStatus.ts": "Empty placeholder file.",
  "frontend/src/hooks/useAdminUsers.ts": "Empty placeholder file.",
  "frontend/src/hooks/useBackendActorSafe.ts": "Creates a backend actor with safe optional admin-token initialization and improved error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and saving the caller’s user profile via the backend actor.",
  "frontend/src/hooks/useSectionConfigs.ts": "Empty placeholder file.",
  "frontend/src/hooks/useWebsiteContent.ts": "Empty placeholder file.",
  "frontend/src/index.css": "Tailwind setup with custom color tokens, dark mode variables, base styles, animations, and scrollbar styling.",
  "frontend/src/main.tsx": "Entry point mounting the app with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Composes homepage layout with hero, about, faculty, courses, contact, footer, and a WhatsApp button.",
  "frontend/src/static-export/renderStaticSite.ts": "Generates a full static HTML page using marketing content and escapes HTML where needed.",
  "frontend/src/static-export/staticExportAssets.ts": "Defines source and destination paths for images to include in static exports.",
  "frontend/src/static-export/zipWriter.ts": "Provides an in-memory ZIP writer placeholder that tracks files and returns an empty archive.",
  "frontend/src/utils/contentSerialization.ts": "Empty file placeholder for future content serialization utilities.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Implements runtime logging and error diagnostics with enable/disable support.",
  "frontend/src/utils/seoGuards.ts": "Applies SEO guards to enforce canonical URLs and noindex rules based on domain.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, plugins, animations, and content paths.",
  "frontend/vite.config.ts": "Vite config with a plugin that generates a static site export, copies assets, and zips the output.",
  "project_state.json": "Defines the project’s current state, including marketing site architecture, static export pipeline, and ICP backend features with role-based access and content-driven sections. Also lists existing frontend and backend features with IDs, descriptions, and version info."
}