{
  "backend/main.mo": "Motoko actor managing user profiles with access control checks, allowing users to view/save their own profiles and exposing a public sitemap URL.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend files, components, test IDs, and confidence levels for multiple About-page-related features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across components, pages, hooks, and configuration.",
  "frontend/.ic-assets.json": "Asset configuration defining caching rules, content headers, and file-specific overrides for IC deployment.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Detailed deployment checklist covering build validation, error diagnosis, publish directory requirements, and local production preview steps.",
  "frontend/DOMAIN_SETUP.md": "Guide explaining DNS, redirect, and SSL configuration for setting up the custom domain sangharshclasses.in on Caffeine hosting.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode tokens, and global layout styles.",
  "frontend/index.html": "Main HTML entry with full SEO metadata, structured data, favicons, and a script loading the React app from /src/main.tsx.",
  "frontend/public/_headers": "Defines custom content types and attachment headers for specific public files.",
  "frontend/public/_redirects": "Netlify-style redirects ensuring static files return 200 and all other routes map to index.html.",
  "frontend/public/404.html": "HTML fallback that redirects non-static paths to the SPA root except excluded files.",
  "frontend/public/google53082ab74af04c28.html": "Google Search Console verification file.",
  "frontend/public/robots.txt": "Allows all crawlers and points to the sitemap URL.",
  "frontend/public/sitemap.xml": "Sitemap listing the home and about pages with metadata.",
  "frontend/src/admin/AdminShell.tsx": "Empty placeholder for future admin shell component.",
  "frontend/src/admin/components/AdminAuthPanel.tsx": "Empty placeholder for future admin authentication UI.",
  "frontend/src/admin/components/AdminGate.tsx": "Empty placeholder for future admin access gate.",
  "frontend/src/admin/components/AdminToasts.ts": "Empty placeholder for future admin toast notifications.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Empty placeholder for a delete confirmation dialog.",
  "frontend/src/admin/components/ProfileSetupModal.tsx": "Empty placeholder for a profile setup modal.",
  "frontend/src/admin/pages/AboutEditorPage.tsx": "Empty placeholder for an admin about-page editor.",
  "frontend/src/admin/pages/AdminHome.tsx": "Empty placeholder for admin dashboard home.",
  "frontend/src/admin/pages/AdminUsersPage.tsx": "Empty placeholder for admin user-management page.",
  "frontend/src/admin/pages/ContactEditorPage.tsx": "Empty placeholder for admin contact-page editor.",
  "frontend/src/admin/pages/CoursesManagerPage.tsx": "Empty placeholder for admin course-management page.",
  "frontend/src/admin/pages/FacultyManagerPage.tsx": "Empty placeholder for admin faculty-management page.",
  "frontend/src/admin/pages/LayoutSectionsPage.tsx": "Empty placeholder for admin layout-section editor.",
  "frontend/src/App.tsx": "Main React app with simple pathname-based routing and initialization of diagnostics and SEO guards.",
  "frontend/src/components/About.tsx": "Renders the About section using marketing content with SEO text, Hindi content, and a feature card.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs errors and shows a runtime fallback UI on failure.",
  "frontend/src/components/Contact.tsx": "Displays contact information with buttons for calling, WhatsApp, and email.",
  "frontend/src/components/Courses.tsx": "Shows a courses grid and a highlighted extra information section from marketing content.",
  "frontend/src/components/DomainSetupDialog.tsx": "Empty placeholder for a domain setup dialog.",
  "frontend/src/components/DownloadWebsiteCodeButton.tsx": "Button that triggers download of a static ZIP file of the website code.",
  "frontend/src/components/Faculty.tsx": "Displays faculty cards with photos, subjects, roles, and experience details.",
  "frontend/src/components/Footer.tsx": "Footer with site info, quick links, contact details, and social media icons.",
  "frontend/src/components/Header.tsx": "Responsive header with scroll-based styling, navigation, and mobile menu using marketing content.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headings, CTAs, and stats sourced from marketing content.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Fallback UI showing an error message with options to refresh or return home.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp contact button that opens a chat using the configured phone number.",
  "frontend/src/content/marketingSiteContent.ts": "Centralized marketing content including site info, hero data, about text, and SEO descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAdminStatus.ts": "Empty placeholder file.",
  "frontend/src/hooks/useAdminUsers.ts": "Empty placeholder file.",
  "frontend/src/hooks/useBackendActorSafe.ts": "Creates a backend actor with optional safe access-control initialization and error-tolerant behavior.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, identity loading, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and saving caller user profiles using the safe backend actor.",
  "frontend/src/hooks/useSectionConfigs.ts": "Empty placeholder file.",
  "frontend/src/hooks/useWebsiteContent.ts": "Empty placeholder file.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme CSS variables, base styles, animations, and custom scrollbar styling.",
  "frontend/src/main.tsx": "React entry point initializing QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata handling and dynamic content from marketingSiteContent.",
  "frontend/src/pages/HomePage.tsx": "Homepage composing header, hero, faculty, courses, contact, and footer components.",
  "frontend/src/static-export/renderStaticSite.ts": "Generates static HTML using marketingSiteContent, including header, hero, faculty, and navigation rendering.",
  "frontend/src/static-export/staticExportAssets.ts": "Defines image assets and their destination paths for static export.",
  "frontend/src/static-export/zipWriter.ts": "In‑memory ZIP writer placeholder that tracks added files and can output an empty ZIP.",
  "frontend/src/utils/contentSerialization.ts": "Empty placeholder file for future content serialization utilities.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Provides optional runtime diagnostics for logging errors and component render events.",
  "frontend/src/utils/seoGuards.ts": "Implements runtime SEO rules enforcing canonical URLs and noindex on non-canonical domains.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended OKLCH color system, custom animations, container settings, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Defines Vite config with React and a custom plugin that generates static HTML/CSS/JS, copies assets, and creates a ZIP package with post-build verification.",
  "project_state.json": "Stores project state, requirements, and known issues related to SEO, content placement, and removal of debug text in the website build."
}