{
  "backend/main.mo": "Actor managing user profiles with access control checks for viewing and saving profiles.",
  "feature_evidence.json": "Feature evidence report describing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "A mapping of frontend file paths to short descriptions of their purpose and functionality.",
  "frontend/.ic-assets.json": "Asset and caching configuration defining headers and cache rules for static files including favicon, sitemap, and robots.txt.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist outlining required build, publish, and verification steps to prevent blank-screen issues.",
  "frontend/DOMAIN_SETUP.md": "Guide for configuring custom domain DNS, redirects, and SEO canonicalization for sangharshclasses.in.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variables, and global element styling.",
  "frontend/index.html": "Main HTML entry with favicon tags, SEO metadata, structured data, and Vite development script reference.",
  "frontend/public/_headers": "Headers configuration specifying correct Content-Type for sitemap, robots, and favicon files.",
  "frontend/public/_redirects": "Redirect rules excluding static files from SPA fallback and routing all other paths to index.html.",
  "frontend/public/404.html": "SPA fallback page that redirects non-static routes to root while excluding specific static files from redirection.",
  "frontend/public/google53082ab74af04c28.html": "Empty Google Search Console verification file for domain ownership.",
  "frontend/public/robots.txt": "Robots.txt allowing full crawling and pointing to the sitemap URL.",
  "frontend/public/sitemap.xml": "XML sitemap listing the homepage with metadata for search indexing.",
  "frontend/src/admin/AdminShell.tsx": "Empty placeholder file for admin shell component.",
  "frontend/src/admin/components/AdminAuthPanel.tsx": "Empty placeholder for the admin authentication panel component.",
  "frontend/src/admin/components/AdminGate.tsx": "Empty placeholder for admin route protection component.",
  "frontend/src/admin/components/AdminToasts.ts": "Empty placeholder for admin toast notifications module.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Empty placeholder for a delete confirmation dialog.",
  "frontend/src/admin/components/ProfileSetupModal.tsx": "Empty placeholder for profile setup modal UI.",
  "frontend/src/admin/pages/AboutEditorPage.tsx": "Empty placeholder for admin About section editor page.",
  "frontend/src/admin/pages/AdminHome.tsx": "Empty placeholder for admin dashboard home page.",
  "frontend/src/admin/pages/AdminUsersPage.tsx": "Empty placeholder for admin user management page.",
  "frontend/src/admin/pages/ContactEditorPage.tsx": "Empty placeholder for admin contact section editor page.",
  "frontend/src/admin/pages/CoursesManagerPage.tsx": "Empty placeholder for admin course manager page.",
  "frontend/src/admin/pages/FacultyManagerPage.tsx": "Empty placeholder for admin faculty manager page.",
  "frontend/src/admin/pages/LayoutSectionsPage.tsx": "Empty placeholder for admin layout sections configuration page.",
  "frontend/src/App.tsx": "Top-level React app initializing diagnostics and SEO guards and rendering HomePage within an error boundary.",
  "frontend/src/components/About.tsx": "Renders the About section with paragraphs describing the institute and a feature card highlighting result‑oriented teaching.",
  "frontend/src/components/AppErrorBoundary.tsx": "Implements a React error boundary that catches runtime errors and displays a fallback component.",
  "frontend/src/components/Contact.tsx": "Provides a contact section with phone, email, location, and quick‑action buttons for calling, WhatsApp, and email.",
  "frontend/src/components/Courses.tsx": "Displays a grid of courses for classes 7–12 with descriptions and feature highlights like tests and expert faculty.",
  "frontend/src/components/DomainSetupDialog.tsx": "Empty component file with no implementation.",
  "frontend/src/components/Faculty.tsx": "Shows faculty cards with photos, subjects, experience, and specialization details.",
  "frontend/src/components/Footer.tsx": "Renders the footer containing about info, quick links, contact details, and social media icons.",
  "frontend/src/components/Header.tsx": "Implements a responsive header with scroll effects, navigation links, and a mobile slide‑out menu.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headings, CTA buttons, and animated stats; includes scroll-to-section handlers.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Displays an error card with refresh and home navigation buttons when runtime errors occur.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp contact button opening a chat to a predefined number.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing on identity change.",
  "frontend/src/hooks/useAdminStatus.ts": "Empty placeholder file.",
  "frontend/src/hooks/useAdminUsers.ts": "Empty placeholder file.",
  "frontend/src/hooks/useBackendActorSafe.ts": "Creates a backend actor with optional safe admin-initialization and logs non-fatal failures.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving the caller’s user profile via the backend actor.",
  "frontend/src/hooks/useSectionConfigs.ts": "Empty placeholder file.",
  "frontend/src/hooks/useWebsiteContent.ts": "Empty placeholder file.",
  "frontend/src/index.css": "Tailwind setup with custom color variables, dark mode, animations, and scrollbar styling.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/HomePage.tsx": "Home page composing header, main sections, footer, and floating WhatsApp button.",
  "frontend/src/utils/contentSerialization.ts": "Empty placeholder file.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Production diagnostics utilities logging runtime errors, promise rejections, and component render starts.",
  "frontend/src/utils/seoGuards.ts": "SEO guards enforcing canonical URLs and noindex rules on non-canonical domains.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), manage stored values in sessionStorage, and sync URL params with persistent storage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, radii, animations, plugins, and content paths.",
  "frontend/vite.config.ts": "Defines Vite build and dev server settings, React plugin setup, env var injection, and asset output configuration.",
  "project_state.json": "Describes project metadata, versioning, and a detailed feature list for the frontend and backend."
}