{
  "backend/main.mo": "Actor handling user profile storage with access control checks and a public sitemap URL.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files and components.",
  "frontend/.ic-assets.json": "Asset configuration defining caching rules and headers for deployment.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Detailed deployment verification checklist to prevent build and hosting issues.",
  "frontend/DOMAIN_SETUP.md": "Guide for configuring custom domains, DNS, redirects, and SSL for the site.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color tokens and dark mode variables.",
  "frontend/index.html": "Source HTML entry with SEO metadata, structured data, and dev script reference.",
  "frontend/public/_headers": "Custom headers configuration for static assets including content types.",
  "frontend/public/_redirects": "Redirect rules enabling SPA routing and static file passthrough.",
  "frontend/public/404.html": "SPA fallback page redirecting unknown routes to root except static assets.",
  "frontend/public/google53082ab74af04c28.html": "Google Search Console verification file.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to sitemap.",
  "frontend/public/sitemap.xml": "XML sitemap listing the homepage with metadata.",
  "frontend/src/admin/AdminShell.tsx": "Empty admin shell file.",
  "frontend/src/admin/components/AdminAuthPanel.tsx": "Empty admin auth panel file.",
  "frontend/src/admin/components/AdminGate.tsx": "Empty admin gate component file.",
  "frontend/src/admin/components/AdminToasts.ts": "Empty admin toasts file.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Empty confirm delete dialog file.",
  "frontend/src/admin/components/ProfileSetupModal.tsx": "Empty admin profile setup modal file.",
  "frontend/src/admin/pages/AboutEditorPage.tsx": "Empty admin about editor page file.",
  "frontend/src/admin/pages/AdminHome.tsx": "Empty admin home page file.",
  "frontend/src/admin/pages/AdminUsersPage.tsx": "Empty admin users page file.",
  "frontend/src/admin/pages/ContactEditorPage.tsx": "Empty admin contact editor page file.",
  "frontend/src/admin/pages/CoursesManagerPage.tsx": "Empty admin courses manager page file.",
  "frontend/src/admin/pages/FacultyManagerPage.tsx": "Empty admin faculty manager page file.",
  "frontend/src/admin/pages/LayoutSectionsPage.tsx": "Empty admin layout sections page file.",
  "frontend/src/App.tsx": "Main React app initializing diagnostics, SEO guards, and rendering HomePage inside an error boundary.",
  "frontend/src/components/About.tsx": "Renders the About section using marketingSiteContent, displaying paragraphs and a feature card.",
  "frontend/src/components/AppErrorBoundary.tsx": "Implements a React error boundary that logs errors and shows a fallback component on failure.",
  "frontend/src/components/Contact.tsx": "Displays contact info with phone, email, WhatsApp actions and styled cards.",
  "frontend/src/components/Courses.tsx": "Shows a grid of course cards with features and an extra info section from marketingSiteContent.",
  "frontend/src/components/DomainSetupDialog.tsx": "Empty component file with no implementation.",
  "frontend/src/components/DownloadWebsiteCodeButton.tsx": "Provides a button that triggers download of a ZIP file containing website code.",
  "frontend/src/components/Faculty.tsx": "Renders faculty cards with photos, roles, experience, and specialization details.",
  "frontend/src/components/Footer.tsx": "Builds the site footer with about text, quick links, contact details, and social icons.",
  "frontend/src/components/Header.tsx": "Creates a responsive header with scroll behavior, navigation, mobile menu, and download button.",
  "frontend/src/components/Hero.tsx": "Renders the main hero section with background, heading, CTA buttons, and stats using marketing content.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Displays an error fallback card with reload and home navigation options.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating button that opens a WhatsApp chat using the configured phone number.",
  "frontend/src/content/marketingSiteContent.ts": "Centralized content configuration for site branding, hero, about, faculty, and courses.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing on identity changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Empty placeholder file.",
  "frontend/src/hooks/useAdminUsers.ts": "Empty placeholder file.",
  "frontend/src/hooks/useBackendActorSafe.ts": "Creates a backend actor with safer optional admin token initialization and basic error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context, identity loading, login, and logout using Internet Identity.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and saving the caller's user profile using the backend actor.",
  "frontend/src/hooks/useSectionConfigs.ts": "Empty placeholder file.",
  "frontend/src/hooks/useWebsiteContent.ts": "Empty placeholder file.",
  "frontend/src/index.css": "Global Tailwind CSS setup with custom brand colors, theming, animations, and scrollbar styling.",
  "frontend/src/main.tsx": "App entry that sets up React Query, Internet Identity provider, and renders the main app.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage layout with header, hero, sections, footer, and WhatsApp button.",
  "frontend/src/static-export/renderStaticSite.ts": "Generates a static HTML page using marketing content and HTML escaping utilities, producing full markup for all site sections.",
  "frontend/src/static-export/staticExportAssets.ts": "Defines a list of image assets to include in the static export, mapping source paths to output destinations.",
  "frontend/src/static-export/zipWriter.ts": "Provides a simple in-memory ZIP file writer placeholder that tracks files and returns an empty ZIP buffer.",
  "frontend/src/utils/contentSerialization.ts": "Empty placeholder file for future content serialization utilities.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Implements runtime diagnostics including error logging, promise rejection tracking, and optional render logging.",
  "frontend/src/utils/seoGuards.ts": "Enforces SEO rules by managing canonical URLs, noindex tags, and domain checks to control indexing behavior.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, and container settings.",
  "frontend/vite.config.ts": "Vite configuration that adds a static export plugin to generate HTML, CSS, JS, copy assets, and produce a ZIP archive post-build.",
  "project_state.json": "Stores project metadata, state version, feature requests, and existing architecture notes."
}