{
  "backend/main.mo": "Motoko canister providing user profile storage and queries with access control and a public sitemap URL.",
  "feature_evidence.json": "Feature evidence report linking a homepage About section requirement to HomePage.tsx and related components.",
  "frontend-file-summaries.txt": "Text file listing summarized descriptions of multiple frontend components and assets.",
  "frontend/.ic-assets.json": "Asset configuration defining caching, headers, and content types for deployed frontend files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Detailed deployment checklist for verifying builds, asset output, redirects, and production readiness.",
  "frontend/DOMAIN_SETUP.md": "Guide explaining DNS, redirect, and SSL setup for using a custom domain with the deployment.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables and theme settings.",
  "frontend/index.html": "Main HTML entry with SEO metadata, structured data, and script mounting the React app.",
  "frontend/public/_headers": "Headers config specifying content types for sitemap, robots, icons, and zip asset.",
  "frontend/public/_redirects": "Redirect rules ensuring proper SPA routing and direct access to specific static files.",
  "frontend/public/404.html": "SPA fallback page that redirects non-static unknown routes to the root.",
  "frontend/public/google53082ab74af04c28.html": "Google Search Console verification file containing the required verification string.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and referencing the sitemap URL.",
  "frontend/public/sitemap.xml": "XML sitemap listing homepage and about page with metadata for crawlers.",
  "frontend/src/admin/AdminShell.tsx": "Empty placeholder file for admin shell component.",
  "frontend/src/admin/components/AdminAuthPanel.tsx": "Empty placeholder for admin authentication panel component.",
  "frontend/src/admin/components/AdminGate.tsx": "Empty placeholder for admin access control wrapper component.",
  "frontend/src/admin/components/AdminToasts.ts": "Empty placeholder for admin toast notifications.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Empty placeholder for a delete confirmation dialog.",
  "frontend/src/admin/components/ProfileSetupModal.tsx": "Empty placeholder for an admin profile setup modal.",
  "frontend/src/admin/pages/AboutEditorPage.tsx": "Empty placeholder for an admin editor page for About content.",
  "frontend/src/admin/pages/AdminHome.tsx": "Empty placeholder for the admin home page.",
  "frontend/src/admin/pages/AdminUsersPage.tsx": "Empty placeholder for admin user management page.",
  "frontend/src/admin/pages/ContactEditorPage.tsx": "Empty placeholder for admin contact section editor page.",
  "frontend/src/admin/pages/CoursesManagerPage.tsx": "Empty placeholder for admin course management page.",
  "frontend/src/admin/pages/FacultyManagerPage.tsx": "Empty placeholder for admin faculty management page.",
  "frontend/src/admin/pages/LayoutSectionsPage.tsx": "Empty placeholder for admin layout sections management page.",
  "frontend/src/App.tsx": "Root React component handling diagnostics, SEO guards, and simple pathname routing between Home and About pages.",
  "frontend/src/components/About.tsx": "Renders the About section using marketingSiteContent, showing SEO text, Hindi paragraphs, and a feature card.",
  "frontend/src/components/AppErrorBoundary.tsx": "Implements a React error boundary that logs errors and displays a fallback component on failure.",
  "frontend/src/components/Contact.tsx": "Displays contact info with phone, WhatsApp, email actions, and styled cards using marketingSiteContent.",
  "frontend/src/components/Courses.tsx": "Shows a grid of courses with features and an extra info section populated from marketingSiteContent.",
  "frontend/src/components/DomainSetupDialog.tsx": "Empty or placeholder component file with no implementation.",
  "frontend/src/components/DownloadWebsiteCodeButton.tsx": "Provides a button that triggers download of a pre-generated ZIP file via a simulated link click.",
  "frontend/src/components/Faculty.tsx": "Renders faculty cards with photos, subjects, experience, and bios from marketingSiteContent.",
  "frontend/src/components/Footer.tsx": "Builds the site footer with branding, quick links, contact details, and social icons.",
  "frontend/src/components/Header.tsx": "Implements a responsive header with logo, navigation, scroll-based styling, and mobile sheet menu.",
  "frontend/src/components/Hero.tsx": "Hero section component showing background, headings, CTAs, and stats with smooth scrolling behavior.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Error fallback UI with message and buttons to refresh or return home.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp contact button that opens a chat using the site's phone number.",
  "frontend/src/content/marketingSiteContent.ts": "Centralized marketing content including hero text, about info, site metadata, and stats.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useAdminUsers.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useBackendActorSafe.ts": "Safe backend actor hook that conditionally initializes admin access and logs non‑fatal failures.",
  "frontend/src/hooks/useInternetIdentity.ts": "Full Internet Identity provider and hook managing login, identity loading, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and saving the caller's user profile using the safe backend actor.",
  "frontend/src/hooks/useSectionConfigs.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useWebsiteContent.ts": "Empty placeholder hook file.",
  "frontend/src/index.css": "Tailwind setup defining color tokens, typography, animations, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point wiring QueryClientProvider, InternetIdentityProvider, and rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata updates and displays English and Hindi content plus a feature card.",
  "frontend/src/pages/HomePage.tsx": "Composes the home page layout by assembling header, main sections, footer, and WhatsApp button.",
  "frontend/src/static-export/renderStaticSite.ts": "Generates static HTML for the marketing site using content data and includes header, nav, hero, and other sections.",
  "frontend/src/static-export/staticExportAssets.ts": "Defines the list of image assets to include and their destination paths for static export.",
  "frontend/src/static-export/zipWriter.ts": "Provides a simple in-memory ZIP builder for tracking files during static export.",
  "frontend/src/utils/contentSerialization.ts": "Empty placeholder for future content serialization utilities.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Implements optional runtime diagnostics including error logging and render tracing.",
  "frontend/src/utils/seoGuards.ts": "Applies SEO rules to enforce canonical URLs and noindex behavior on non-canonical domains.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and managing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, containers, animations, and plugins.",
  "frontend/vite.config.ts": "Vite config defining a static export plugin that generates HTML, CSS, JS, copies assets, zips the output, and performs post-build verification.",
  "project_state.json": "JSON metadata describing project state, including a fix request to restore the homepage About section exactly as before."
}