{
  "kind": "build_request",
  "title": "Restore the previously removed About section exactly as it was",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the original homepage About section exactly as it existed previously by re-rendering the existing About section component on the homepage (without modifying its content, tone, design, layout, styling, or wording).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Please restore the previous About section exactly as it was before.\nThe About section was removed by mistake.\nDo not change the content, tone, design, layout, or wording.\nJust bring back the same original About section that existed earlier.\nNo extra edits, no new text, no optimization — only restore the old About section."
        ]
      },
      "acceptanceCriteria": [
        "The homepage once again contains the About section (the section with id=\"about\") rendered from the existing About component.",
        "No text changes occur anywhere inside the restored About section (including headings, paragraphs, and feature-card copy).",
        "No design/layout/styling changes occur to the About section compared to the prior version (same structure, spacing, typography, and UI elements).",
        "No additional sections, copy, or “optimized”/rewritten content is introduced as part of this change."
      ]
    }
  ],
  "constraints": [
    "Do not change the About section content, tone, design, layout, styling, or wording; only restore what was removed.",
    "Limit the change to restoring the previously existing About section; avoid unrelated refactors or formatting changes."
  ],
  "nonGoals": [
    "Adding new About text, rewriting or optimizing existing About copy.",
    "Changing navigation/routing behavior beyond what is strictly required to restore the removed About section.",
    "Any backend changes or new data storage for About content."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}