{
  "kind": "build_request",
  "title": "Add offline static source-code export + ZIP download button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate a complete offline-capable static export of the current marketing website (same content, sections, text, and layout as the existing React site) in the following exact folder structure inside the downloadable package: index.html, css/style.css, js/script.js, assets/images/.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Give FULL website code (HTML, CSS, JavaScript)",
          "Code must be properly structured in folders: - index.html - css/style.css - js/script.js - assets/images/",
          "Include ALL content, design, sections, text, and layout exactly as currently built.",
          "Ensure the website works offline after download."
        ]
      },
      "acceptanceCriteria": [
        "A static export package exists that contains exactly: /index.html, /css/style.css, /js/script.js, /assets/images/ (may contain additional image files under assets/images only).",
        "Opening index.html from disk (file://) renders a visually equivalent single-page website with the same sections and copy as the current deployed React homepage (Hero, About, Faculty, Courses, Contact, Footer, WhatsApp button).",
        "The exported website loads all required styling and scripts locally (no required external CDN dependencies) and functions offline."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a clear user-facing button labeled exactly \"Download Website Code\" on the website UI that initiates download of the full website code as a ZIP file containing the static export structure (index.html, css/style.css, js/script.js, assets/images/).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "After providing the code, ADD a clear \"Download Website Code\" button.",
          "The download button should allow downloading the full website code as a ZIP file."
        ]
      },
      "acceptanceCriteria": [
        "A visible button labeled exactly \"Download Website Code\" is present on the homepage (desktop and mobile).",
        "Clicking the button downloads a .zip file.",
        "The .zip file contains the exported site in the required folder structure and works offline when unzipped and opened."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the downloadable ZIP always matches the currently built website content/design (i.e., changes to homepage content/layout/styles in the app are reflected in the exported HTML/CSS/JS on the next build) and does not omit any current sections or text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Include ALL content, design, sections, text, and layout exactly as currently built.",
          "Do NOT skip any part of the website."
        ]
      },
      "acceptanceCriteria": [
        "The export is generated from the same canonical source content used by the live homepage so it cannot drift (no missing sections compared to the React homepage).",
        "The exported page includes all visible homepage sections and key interactive elements present on the live site (e.g., navigation scroll links and WhatsApp contact action)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make the ZIP file available as a static asset served by the deployed frontend (so the download works without requiring any backend changes) and ensure appropriate caching/headers so users can reliably download it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Deliver everything directly in this chat."
        ]
      },
      "acceptanceCriteria": [
        "The ZIP is served from the frontend as a static file and can be downloaded in production by unauthenticated users.",
        "Downloading the ZIP does not require Internet Identity login and does not call the Motoko backend.",
        "The file is delivered with a correct content type for ZIP downloads and a stable filename."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources must be composed, not edited).",
    "Do not modify frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), or frontend/src/hooks/useActor.ts (paths listed as immutable).",
    "Respect the existing single-page marketing homepage content and SEO hardening; do not remove canonical/noindex enforcement, structured data, sitemap.xml, robots.txt, or the Google Search Console verification file."
  ],
  "nonGoals": [
    "Do not implement an admin CMS or editing UI for website content (admin-related placeholders are out of scope).",
    "Do not add new backend features or require the Motoko canister to generate ZIP files.",
    "Do not change authentication behavior (Internet Identity / RBAC) as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}